import 'package:get/get.dart';

class LocalString extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'en_US': {
          'hello': 'HELLO WORLD',
          'find': 'Find Friends & Get Inspiration the world',
          'welcome': 'welcome to',
          'myttube': 'myttube',
          'login': 'Login',
          'guest': 'Guest Login',
          'signup': 'Sign up',
          'dont': 'Don\'t have an account?',
          'or': 'OR',
          'continue': 'Continue with Google',
          'forgot': 'Forgot Password ?',
          'username': 'Enter Your Username',
          'password': 'Enter Password',
          'email': 'Email',
          'mobile': 'Mobile',
          'confirm': 'Confirm & Continue',
          'select': 'Select one (via verification) for secure your profile',
          'keep':
              'To help keep your profile safe, my tube wants to\n make sure that it’s really you who trying to reset the password.'
        },
        'hi_IN': {
          'hello': 'नमस्ते',
          'find': 'दोस्तों को खोजें और दुनिया को प्रेरणा दें',
          'welcome': 'आपका स्वागत है',
          'myttube': 'मायट्यूब',
          'login': 'लॉग इन करें',
          'guest': 'मेहमान लॉगइन करें',
          'signup': 'साइन अप करें',
          'dont': 'खाता नहीं है?',
          'or': 'या',
          'continue': 'Google के साथ जारी रखें',
          'forgot': "पासवर्ड भूल गए ?",
          'username': 'अपना उपयोगकर्ता नाम दर्ज करें',
          'password': 'पास वर्ड दर्ज करें',
          'email': 'ईमेल',
          'mobile': 'मोबाइल',
          'confirm': 'पुष्टि करें और जारी रखें',
          'select':
              'अपनी प्रोफ़ाइल सुरक्षित करने के लिए एक (सत्यापन के माध्यम से) का चयन करें',
          'keep':
              'आपकी प्रोफ़ाइल को सुरक्षित रखने में मदद करने के लिए, मेरी ट्यूब\n यह सुनिश्चित करना चाहती है कि यह वास्तव में आप ही हैं जो\n पासवर्ड रीसेट करने का प्रयास कर रहे हैं।'
        },
        'bn_IN': {
          'hello': 'হ্যালো',
          'find': 'বন্ধুদের খুঁজুন এবং বিশ্বের অনুপ্রেরণা পান',
          'welcome': 'স্বাগতম',
          'myttube': 'আমার টিউব',
          'login': 'প্রবেশ করুন',
          'guest': 'গেস্ট লগইন',
          'signup': 'নিবন্ধন করুন',
          'dont': 'একটি অ্যাকাউন্ট নেই?',
          'or': 'বা',
          'continue': 'Google এর সাথে চালিয়ে যান',
          'forgot': "পাসওয়ার্ড ভুলে গেছেন ?",
          'username': 'আপনার ব্যবহারকারীর নাম লিখুন',
          'password': 'পাসওয়ার্ড লিখুন',
          'email': 'ইমেইল',
          'mobile': 'মুঠোফোন',
          'confirm': 'নিশ্চিত করুন এবং চালিয়ে যান',
          'select':
              'আপনার প্রোফাইল সুরক্ষিত করার জন্য একটি (যাচাইয়ের মাধ্যমে) নির্বাচন করুন',
          'keep':
              'আপনার প্রোফাইল নিরাপদ রাখতে সাহায্য করার জন্য, আমার টিউব\n নিশ্চিত করতে চায় যে আপনিই পাসওয়ার্ড রিসেট করার চেষ্টা করছেন।'
        },
        'gu_IN': {
          'hello': 'નમસ્તે',
          'find': 'મિત્રો શોધો અને વિશ્વની પ્રેરણા મેળવો',
          'welcome': 'સ્વાગત',
          'myttube': 'મારી ટ્યુબ',
          'login': 'પ્રવેશ કરો',
          'guest': 'મહેમાન લૉગિન',
          'signup': 'સાઇન અપ કરો',
          'dont': 'ખાતું નથી?',
          'or': 'અથવા',
          'continue': 'Google સાથે ચાલુ રાખો',
          'forgot': "પાસવર્ડ ભૂલી ગયા છો?",
          'username': 'તમારું વપરાશકર્તા નામ દાખલ કરો',
          'password': 'પાસવર્ડ દાખલ કરો',
          'email': 'ઇમેઇલ',
          'mobile': 'મોબાઇલ',
          'confirm': 'પુષ્ટિ કરો અને ચાલુ રાખો',
          'select':
              'તમારી પ્રોફાઇલને સુરક્ષિત કરવા માટે એક (ચકાસણી દ્વારા) પસંદ કરો',
          'keep':
              'તમારી પ્રોફાઇલને સુરક્ષિત રાખવામાં મદદ કરવા માટે, મારી ટ્યુબ એ ખાતરી\n કરવા માંગે છે કે પાસવર્ડ રીસેટ કરવાનો પ્રયાસ કરનાર ખરેખર તમે જ છો.'
        },
        'mr_IN': {
          'hello': 'नमस्कार',
          'find': 'मित्र शोधा आणि जगाला प्रेरणा मिळवा',
          'welcome': 'आपले स्वागत आहे',
          'myttube': 'माझी ट्यूब',
          'login': 'लॉगिन करा',
          'guest': 'अतिथी लॉगिन',
          'signup': 'साइन अप करा',
          'dont': 'खाते नाही?',
          'or': 'किंवा',
          'continue': 'Google सह सुरू ठेवा',
          'forgot': "पासवर्ड विसरलात?",
          'username': 'आपले वापरकर्तानाव प्रविष्ट करा',
          'password': 'पासवर्ड टाका',
          'email': 'ईमेल',
          'mobile': 'मोबाईल',
          'confirm': 'पुष्टी करा आणि सुरू ठेवा',
          'select':
              'तुमचे प्रोफाइल सुरक्षित करण्यासाठी एक (सत्यापनाद्वारे) निवडा',
          'keep':
              'तुमची प्रोफाईल सुरक्षित ठेवण्‍यात मदत करण्‍यासाठी, माझी ट्यूब\n खात्री करू इच्छिते की पासवर्ड रीसेट करण्‍याचा\n प्रयत्‍न करणारे खरोखर तुम्हीच आहात.'
        },
        'ur_IN': {
          'hello': 'ہیلو',
          'find': 'دوست تلاش کریں اور دنیا کو متاثر کریں۔',
          'welcome': 'میں خوش آمدید',
          'myttube': 'میری ٹیوب',
          'login': 'لاگ ان کریں',
          'guest': 'مہمان لاگ ان',
          'signup': 'سائن اپ',
          'dont': 'اکاؤنٹ نہیں ہے؟',
          'or': 'یا',
          'continue': 'گوگل کے ساتھ جاری رکھیں',
          'forgot': "پاسورڈ بھول گے ؟",
          'username': 'اپنے یوزر نام کا اندراج کرو',
          'password': 'پاس ورڈ درج کریں',
          'email': 'ای میل',
          'mobile': 'موبائل',
          'confirm': 'تصدیق کریں اور جاری رکھیں',
          'select':
              'اپنے پروفائل کو محفوظ بنانے کے لیے (تصدیق کے ذریعے) ایک کو منتخب کریں۔',
          'keep':
              'آپ کے پروفائل کو محفوظ رکھنے میں مدد کے لیے، میری ٹیوب \nاس بات کو یقینی بنانا چاہتی ہے کہ واقعی آپ ہی ہیں جو پاس ورڈ\n کو دوبارہ ترتیب دینے کی کوشش کر رہے ہیں'
        },
        'or_IN': {
          'hello': 'ନମସ୍କାର',
          'find': 'ବନ୍ଧୁ ଖୋଜ ଏବଂ ଦୁନିଆର ପ୍ରେରଣା ପାଅ ',
          'welcome': 'କୁ ସ୍ଵାଗତ',
          'myttube': 'ମୋ ଟ୍ୟୁବ୍',
          'login': 'ଭିତରକୁ ଯାଉ',
          'guest': 'ଅତିଥି ଲଗଇନ୍',
          'signup': 'ସାଇନ୍ ଅପ୍ କରନ୍ତୁ',
          'dont': 'ଖାତା ନାହିଁ କି?',
          'or': 'କିମ୍ବା',
          'continue': 'ଗୁଗୁଲ୍ ସହିତ ଜାରି ରଖନ୍ତୁ',
          'forgot': "ପାସୱାର୍ଡ଼ ଭୁଲି ଗଲେ କି ?",
          'username': 'ଆପଣଙ୍କର ଉପଯୋଗକର୍ତ୍ତା ନାମ ପ୍ରବେଶ କରନ୍ତୁ |',
          'password': 'ପାସୱାର୍ଡ ପ୍ରବେଶ କରନ୍ତୁ |',
          'email': 'ଇମେଲ୍ |',
          'mobile': 'ମୋବାଇଲ୍ |',
          'confirm': 'ନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ଜାରି ରଖନ୍ତୁ |',
          'select':
              'ଆପଣଙ୍କର ପ୍ରୋଫାଇଲ୍ ସୁରକ୍ଷିତ କରିବା ପାଇଁ ଗୋଟିଏ (ଯାଞ୍ଚ ମାଧ୍ୟମରେ) ଚୟନ କରନ୍ତୁ |',
          'keep':
              'ତୁମର ପ୍ରୋଫାଇଲକୁ ସୁରକ୍ଷିତ ରଖିବାରେ ସାହାଯ୍ୟ କରିବାକୁ, ମୋ ଟ୍ୟୁବ୍ ନିଶ୍ଚିତ କରିବାକୁ\n ଚାହୁଁଛି ଯେ ପ୍ରକୃତରେ ଆପଣ ହିଁ ପାସୱାର୍ଡ ପୁନ res ସେଟ୍ କରିବାକୁ ଚେଷ୍ଟା କରୁଛନ୍ତି |'
        },
        'kn_IN': {
          'hello': 'ನಮಸ್ಕಾರ',
          'find': 'ಸ್ನೇಹಿತರನ್ನು ಹುಡುಕಿ ಮತ್ತು ಜಗತ್ತಿಗೆ ಸ್ಫೂರ್ತಿ ಪಡೆಯಿರಿ',
          'welcome': 'ಸ್ವಾಗತ',
          'myttube': 'ನನ್ನ ಟ್ಯೂಬ್',
          'login': 'ಲಾಗಿನ್ ಮಾಡಿ',
          'guest': 'ಅತಿಥಿ ಲಾಗಿನ್',
          'signup': 'ಸೈನ್ ಅಪ್ ಮಾಡಿ',
          'dont': 'ಖಾತೆಯನ್ನು ಹೊಂದಿಲ್ಲವೇ?',
          'or': 'ಅಥವಾ',
          'continue': 'Google ನೊಂದಿಗೆ ಮುಂದುವರಿಯಿರಿ',
          'forgot': "ಪಾಸ್ವರ್ಡ್ ಮರೆತಿರಾ ?",
          'username': 'ನಿಮ್ಮ ಬಳಕೆದಾರ ಹೆಸರು ನಮೂದಿಸಿ',
          'password': 'ಪಾಸ್ವರ್ಡ್ ನಮೂದಿಸಿ',
          'email': 'ಇಮೇಲ್',
          'mobile': 'ಮೊಬೈಲ್',
          'confirm': 'ದೃಢೀಕರಿಸಿ ಮತ್ತು ಮುಂದುವರಿಸಿ',
          'select':
              'ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಅನ್ನು ಸುರಕ್ಷಿತವಾಗಿರಿಸಲು ಒಂದನ್ನು (ಪರಿಶೀಲನೆಯ ಮೂಲಕ) ಆಯ್ಕೆಮಾಡಿ',
          'keep':
              'ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಅನ್ನು ಸುರಕ್ಷಿತವಾಗಿರಿಸಲು ಸಹಾಯ ಮಾಡಲು, ಪಾಸ್‌ವರ್ಡ್\n ಅನ್ನು ಮರುಹೊಂದಿಸಲು ಪ್ರಯತ್ನಿಸುತ್ತಿರುವವರು ನಿಜವಾಗಿಯೂ ನೀವೇ\n ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಲು ನನ್ನ ಟ್ಯೂಬ್ ಬಯಸುತ್ತದೆ.'
        },
        'ta_IN': {
          'hello': 'வணக்கம்',
          'find': 'நண்பர்களைக் கண்டுபிடி & உலகிற்கு உத்வேகம் பெறுங்கள்',
          'welcome': 'வரவேற்கிறோம்',
          'myttube': 'என் குழாய்',
          'login': 'உள்நுழைய',
          'guest': 'விருந்தினர் உள்நுழைவு',
          'signup': 'பதிவு செய்யவும்',
          'dont': 'கணக்கு இல்லையா?',
          'or': 'அல்லது',
          'continue': 'Google உடன் தொடரவும்',
          'forgot': "கடவுச்சொல்லை மறந்துவிட்டீர்களா ?",
          'username': 'உங்கள் பயனர்பெயரை உள்ளிடவும்',
          'password': 'கடவுச்சொல்லை உள்ளிடவும்',
          'email': 'மின்னஞ்சல்',
          'mobile': 'கைபேசி',
          'confirm': 'உறுதிசெய்து தொடரவும்',
          'select':
              'உங்கள் சுயவிவரத்தைப் பாதுகாக்க \n ஒன்றை (சரிபார்ப்பு மூலம்) தேர்ந்தெடுக்கவும்',
          'keep':
              'உங்கள் சுயவிவரத்தைப் பாதுகாப்பாக வைத்திருக்க\n உதவ, கடவுச்சொல்லை மீட்டமைக்க\n முயற்சிப்பது நீங்கள்தான் என்பதை எனது\n குழாய் உறுதிப்படுத்த விரும்புகிறது.'
        },
        'te_IN': {
          'hello': 'హలో',
          'find': 'స్నేహితులను కనుగొనండి & ప్రపంచానికి స్ఫూర్తిని పొందండి',
          'welcome': 'కు స్వాగతం',
          'myttube': 'నా ట్యూబ్',
          'login': 'ప్రవేశించండి',
          'guest': 'అతిథి లాగిన్',
          'signup': 'చేరడం',
          'dont': 'ఖాతా లేదా?',
          'or': 'లేదా',
          'continue': 'Googleతో కొనసాగించండి',
          'forgot': "పాస్వర్డ్ మర్చిపోయారా?",
          'username': 'మీ వినియోగదారు పేరును నమోదు చేయండి',
          'password': 'రహస్య సంకేతం తెలపండి',
          'email': 'ఇమెయిల్',
          'mobile': 'మొబైల్',
          'confirm': 'నిర్ధారించండి & కొనసాగించండి',
          'select':
              'మీ ప్రొఫైల్‌ను భద్రపరచడానికి ఒకదాన్ని (ధృవీకరణ ద్వారా) ఎంచుకోండి',
          'keep':
              'మీ ప్రొఫైల్‌ను సురక్షితంగా ఉంచడంలో సహాయం చేయడానికి,\n పాస్‌వర్డ్‌ని రీసెట్ చేయడానికి ప్రయత్నిస్తున్నది నిజంగా మీరేనని\n నా ట్యూబ్ నిర్ధారించుకోవాలనుకుంటోంది.'
        },
      };
}
